test/pytest_example/granular/openfoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version	 2.0;
	format	 ascii;
	class	 dictionary;
	object	 controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application 	 cplIcoFoam;
startFrom 	     startTime;
startTime 	     0;
stopAt 	         endTime;
endTime 	     50;
deltaT 	         0.05;
writeControl 	 runTime;
writeInterval 	 1.0;
purgeWrite 	     0;
writeFormat 	 ascii;
writePrecision 	 6;
writeCompression off;
timeFormat 	     general;
timePrecision 	 6;
runTimeModifiable 	 true;
graphFormat 	 raw;

DebugSwitches
{
	dimensionSet 0;
}
// ************************************************************************* //
